{
    "Spanish": {
        "title": "Sistema de Detección Temprana de Linfedema",
        "begin_detection": "Comenzar Detección",
        "about": "Acerca de",
        "about_text": "Este es el Sistema de Detección Temprana de Linfedema. Está diseñado para detectar signos tempranos de linfedema utilizando algoritmos de aprendizaje automático.",
        "return_main_menu": "Volver al Menú Principal",
        "detection_page": "Página de Detección",
        "reported_symptoms": "Síntomas reportados",
        "submit": "Enviar",
        "return": "Regresar",
        "detection_result": "Resultado de la Detección",
        "low_risk": "Bajo riesgo",
        "mild": "Leve",
        "moderate_severe": "Moderado/Severo",
        "moderate/severe": "Moderado/Severo",
        "visualized diagnosis": "Diagnóstico visualizado",
        "your_predicted_lymphedema_risk": "Su riesgo de linfedema predicho es: {risk}.",
        "Your predicted Lymphedema risk is: Low risk.": "Su riesgo de linfedema predicho es: Bajo riesgo.",
        "Your predicted Lymphedema risk is: Mild.": "Su riesgo de linfedema predicho es: Leve.",
        "Your predicted Lymphedema risk is: Moderate/Severe.": "Su riesgo de linfedema predicho es: Moderado/Severo.",
        "您预测的淋巴水肿风险是: 低风险。": "Su riesgo de linfedema predicho es: Bajo riesgo.",
        "您预测的淋巴水肿风险是: 轻度。": "Su riesgo de linfedema predicho es: Leve.",
        "您预测的淋巴水肿风险是: 中度/重度。": "Su riesgo de linfedema predicho es: Moderado/Severo.",
        "Su riesgo de linfedema predicho es: Bajo riesgo.": "Su riesgo de linfedema predicho es: Bajo riesgo.",
        "Su riesgo de linfedema predicho es: Leve.": "Su riesgo de linfedema predicho es: Leve.",
        "Su riesgo de linfedema predicho es: Moderado/Severo.": "Su riesgo de linfedema predicho es: Moderado/Severo.",
        "Age (years)": "Tu edad (años)",
        "Time Lapse (years)": "Lapso de tiempo (años)",
        "Weight (Kg)": "Peso corporal (Kg)",
        "Height (cm)": "Altura (cm)",
        "Limited shoulder movement": "Movimiento limitado del hombro",
        "Limited elbow movement": "Movimiento limitado del codo",
        "Limited wrist movement": "Movimiento limitado de la muñeca",
        "Limited fingers movement": "Movimiento limitado de los dedos",
        "Limited arm movement": "Movimiento limitado del brazo",
        "Arm or hand swelling": "Hinchazón del brazo o mano",
        "Breast swelling": "Hinchazón del pecho",
        "Chest swelling": "Hinchazón del pecho",
        "Toughness or thickness of skin": "Dureza o grosor de la piel",
        "Pain, aching, soreness": "Dolor, dolorido, molestia",
        "Tightness": "Tensión",
        "Firmness": "Firmeza",
        "Heaviness": "Pesadez",
        "Numbness": "Entumecimiento",
        "Burning": "Ardor",
        "Stabbing": "Punzante",
        "Tingling": "Hormigueo",
        "Fatigue": "Fatiga",
        "Weakness": "Debilidad",
        "Redness": "Enrojecimiento",
        "Hotness": "Calor",
        "Stiffness": "Rigidez",
        "Tenderness": "Sensibilidad",
        "Blister": "Ampolla",
        "Chemotherapy": "Quimioterapia",
        "Radiation": "Radiación",
        "SLNB_Removed_LN": "SLNB Extirpación de LN",
        "ALND_Removed_LN": "ALND Extirpación de LN",
        "SLNB_ALND_Removed": "SLNB ALND Extirpado",
        "Mastectomy": "Mastectomía",
        "Lumpectomy": "Lumpectomía",
        "Hormonal therapy": "Terapia hormonal",
        "Your age (years)": "Su edad (años)",
        "Time lapse since your recent breast cancer surgery (years)": "Tiempo transcurrido desde su reciente cirugía de cáncer de mama (años)",
        "Body weight (Kg)": "Peso corporal (Kg)",
        "How much do you feel your shoulder movement is limited?": "¿Cuánto siente que su movimiento del hombro está limitado?",
        "How much do you feel your elbow movement is limited?": "¿Cuánto siente que su movimiento del codo está limitado?",
        "How much do you feel your wrist movement is limited?": "¿Cuánto siente que su movimiento de la muñeca está limitado?",
        "How much do you feel your fingers movement is limited?": "¿Cuánto siente que su movimiento de los dedos está limitado?",
        "How much do you feel your arm movement is limited?": "¿Cuánto siente que su movimiento del brazo está limitado?",
        "How much do your arm or hand swell: if both, select the most intense feelings.": "¿Cuánto se hinchan su brazo o mano: si ambos, seleccione las sensaciones más intensas?",
        "How much does your breast swell?": "¿Cuánto se hincha su pecho?",
        "How much does your chest swell?": "¿Cuánto se hincha su pecho?",
        "Do you feel pain, aching, or soreness: if more than one feeling, select the most intense one.": "¿Siente dolor, molestia o sensibilidad: si siente más de una sensación, seleccione la más intensa?",
        "Tightness of your affected arm.": "Rigidez de su brazo afectado.",
        "Firmness of your affected arm.": "Firmeza de su brazo afectado.",
        "Heaviness of your affected arm.": "Pesadez de su brazo afectado.",
        "Numbness of your affected arm.": "Entumecimiento de su brazo afectado.",
        "The feeling of burning of your affected arm.": "La sensación de ardor en su brazo afectado.",
        "The feeling of stabbing of your affected arm.": "La sensación de puñalada en su brazo afectado.",
        "The feeling of tingling, or feeling of needles of your affected arm.": "La sensación de hormigueo o sensación de agujas en su brazo afectado.",
        "The feeling of fatigue of your affected arm.": "La sensación de fatiga en su brazo afectado.",
        "The feeling of weakness of your affected arm.": "La sensación de debilidad en su brazo afectado.",
        "How much does your affected arm looks red?": "¿Qué tan roja se ve su brazo afectado?",
        "How much does your affected arm feel hot?": "¿Qué tan caliente se siente su brazo afectado?",
        "How much does your affected arm feel stiff?": "¿Qué tan rígido se siente su brazo afectado?",
        "How much does your affected arm feel sensitive or tender when touching things?": "¿Qué tan sensible o tierno se siente su brazo afectado al tocar cosas?",
        "Does you affected arm blisters?": "¿Tiene ampollas en su brazo afectado?",
        "Whether the patient had chemotherapy.": "Si el paciente recibió quimioterapia.",
        "Whether the patient had radiation.": "Si el paciente recibió radiación.",
        "The number of removed sentinel lymph nodes.": "El número de ganglios linfáticos centinela eliminados.",
        "The number of removed axillary lymph nodes": "El número de ganglios linfáticos axilares eliminados",
        "The number of removed lymph nodes when the patient has both SLNB and ALND removed.": "El número de ganglios linfáticos eliminados cuando el paciente tiene tanto SLNB como ALND eliminados.",
        "Whether the patient had Mastectomy.": "Si el paciente tuvo Mastectomía.",
        "Whether the patient had Lumpectomy.": "Si el paciente tuvo Lumpectomía.",
        "Whether the patient had hormonal therapy.": "Si el paciente tuvo terapia hormonal.",
        "None": "Ninguno", 
        "A little": "Un poco",
        "Somewhat": "Algo", 
        "Quite a bit": "Relativamente grave", 
        "Severe": "Severo",
        "In the detection page, detailed instructions are shown when you move the cursor🖱️ close to the words (for example, Your age (years)...).": "En la página de detección, se muestran instrucciones detalladas cuando mueve el cursor🖱️ cerca de las palabras (por ejemplo, su edad (años)...).",
        "Help": "Ayuda",
        "Language": "Lengua",
        "Instructions": "Instrucciones",
        "About": "Acerca de",
        "Yes": "Sí",
        "No": "No",
        "Incomplete Data": "Datos incompletos",
        "Data not fully completed. Please fill in all required fields.": "Datos no completados. Por favor rellene todos los campos requeridos.",
        "Login/Register": "Inicio de sesión/registro",
        "You're logged out now. Please register or login first.": "Ahora estás desconectado. Por favor regístrate o inicia sesión primero.",
        "Not login": "No iniciar sesión",
        "Logout": "Cerrar sesión",
        "Logout sccessfully.": "Cierre de sesión exitoso.",
        "Account": "Cuenta",
        "Username:": "Nombre de usuario:",
        "Password:": "Contraseña:",
        "Login": "Iniciar sesión",
        "Register": "Registrarse",
        "Login successful": "Inicio de sesión exitoso",
        "Invalid username or password: your username or password is incorrect.": "Nombre de usuario o contraseña incorrectos: su nombre de usuario o contraseña es incorrecto.",
        "Username already exists": "El nombre de usuario ya existe",
        "Invalid username or password: can NOT be empty.": "Nombre de usuario o contraseña incorrectos: no pueden estar vacíos.",
        "Registration successful, please login next.": "Registro exitoso, por favor inicie sesión.",
        "Login as: ": "Iniciar sesión como: ",
        "You are logged out": "Has cerrado sesión",
        "Reset": "Restablecer",
        "Save": "Guardar",
        "Lymphedema risk score": "Puntuación de riesgo de linfedema",
        "Predicted possibility of your Lymphedema stage": "Posibilidad predicha de su etapa de linfedema",
        "Lymphedema Risk Score History": "Historial de puntuaciones de riesgo de linfedema",
        "Score": "Puntuación",
        "Test Number": "Número de prueba",
        "last 5 times": "Últimas 5 veces",
        "last 10 times": "Últimas 10 veces",
        "last 20 times": "Últimas 20 veces",
        "Overall": "Total",
        "Important factors contributing to Lymphedema": "Factores importantes que contribuyen al linfedema",
        "Symptom severity": "Gravedad de los síntomas",
        "time lapse since last surgery": "Tiempo transcurrido desde la última cirugía",
        "Height and weight (BMI)": "Altura y peso (IMC)",
        "Tightness, firmness, and heaviness": "Opresión, firmeza y pesadez",
        "Age": "Edad",
        "Number of removed nodes": "Número de ganglios removidos",
        "Toughness of skin": "Dureza de la piel",
        "Discomfort": "Molestia",
        "Pain, aching and soreness": "Dolor, dolorido y molestia",
        "Hormonal": "Hormonal",
        "Limited Mobility": "Movilidad limitada",
        "ChestWall swelling": "Hinchazón de la pared torácica",
        "Fontsize": "fuente",
        "Small": "Pequeño",
        "Medium": "Mediano",
        "Large": "Grande",
        "Super Large": "Súper grande",
        "Restart": "Reiniciar",
        "Changing the fontsize will restart the system. Make sure the data is saved.": "Cambiar el tamaño de la fuente reiniciará el sistema. Asegúrate de que los datos estén guardados.",
        "Data saved!": "¡Datos guardados!",
        "Confirmation": "Confirmación",
        "Are you sure you want to reset? This will clear your reported symptoms.": "¿Estás seguro de que quieres restablecer? Esto borrará tus síntomas reportados.",
        "diag_low_risk": "Sugerencias  \n\nPara las personas con bajo riesgo de linfedema, es esencial estar informados sobre la condición y sus síntomas tempranos, como la hinchazón o los cambios en la piel. Mantén un peso saludable mediante una dieta equilibrada y ejercicio regular, mantiene la piel hidratada y protegida de lesiones, y evita levantar objetos pesados o hacer actividades que tensionen tus extremidades. Usa prendas de compresión cuando se recomienden y ten cuidado con las temperaturas extremas. Monitorea regularmente cualquier cambio y consulta a tu proveedor de atención médica rápidamente si desarrollas síntomas.",
        "diag_mild": "Sugerencias  \n\nPara las personas con linfedema leve, es crucial manejar su condición mediante una monitorización regular y ajustes en el estilo de vida. Mantén un peso saludable con una dieta equilibrada y ejercicio regular, y practica un cuidadoso cuidado de la piel para prevenir infecciones. Usa prendas de compresión según lo recomendado por tu proveedor de atención médica para apoyar la función linfática. Evita actividades que tensen excesivamente la extremidad afectada y ten cuidado con las temperaturas extremas. Las revisiones regulares con tu proveedor de atención médica son esenciales para monitorear la condición y asegurar una intervención oportuna si los síntomas progresan.",
        "diag_moderate_severe": "Sugerencias  \n\nPara las personas con linfedema moderado a severo, la gestión integral es crucial. Adhiérete a un régimen que incluya el uso constante de prendas de compresión, masajes regulares de drenaje linfático y ejercicios de fisioterapia diseñados para mejorar el flujo linfático. Mantén un cuidado riguroso de la piel para prevenir infecciones y evita cortes y quemaduras. Monitorea tu condición de cerca y mantén citas regulares con tu proveedor de atención médica para seguir el progreso y ajustar los tratamientos según sea necesario. Limita las actividades que ejerzan una tensión excesiva en el área afectada y ten cuidado con las temperaturas extremas. La intervención temprana y proactiva es clave para manejar los síntomas y mejorar la calidad de vida.",
        "This is your first time detecting Lymphedema. Keep on excercising and let us see your progress!": "Comentarios:  \n\nEsta es la primera vez que detecta linfedema. ¡Sigue ejercitando y veamos tu progreso!",
        "This is your first time detecting Lymphedema. Keep on the good record!": "Comentarios:  \n\nEsta es la primera vez que detecta linfedema. ¡Mantén el buen registro!",
        "Your detection result shows low risk, keep on the good record!": "Comentarios:  \n\nTu resultado de detección muestra un riesgo bajo, ¡mantén el buen registro!",
        "Your detection result requires further inspection, please advice the doctors for further help. Keep on excercising and let us see your progress!": "Comentarios:  \n\nTu resultado de detección requiere una inspección adicional, por favor consulta a los médicos para más ayuda. ¡Sigue ejercitándote y veamos tu progreso!",
        "Your detection result does not change since the last time. Keep on excercising and let us see your progress!": "Comentarios:  \n\nTu resultado de detección no ha cambiado desde la última vez. ¡Sigue ejercitándote y veamos tu progreso!",
        "Congratulations! Your detection result is much better than your last time. Keep on the good record!": "Comentarios:  \n\n¡Felicidades! Tu resultado de detección es mucho mejor que la última vez. ¡Mantén el buen registro!",
        "Congratulations! Your detection result is better than your last time. Keep on excercising and keep on the good record!": "Comentarios:  \n\n¡Felicidades! Tu resultado de detección es mejor que la última vez. ¡Sigue ejercitándote y mantén el buen registro!",
        "recommendation":"\n\nAdemás, para finalizar el diagnóstico, le recomendamos que proceda con el diagnóstico visualizado (presione el botón en la esquina inferior izquierda), para acceder a su puntaje de riesgo detallado de linfedema, las probabilidades de la etapa de linfedema, su historial de diagnóstico y los factores que influyen en el linfedema.",
        "Are you sure you want to delete this account? This operation can't be reversed.": "¿Estás seguro de que deseas eliminar esta cuenta? Esta operación no se puede revertir.",
        "Delete Account": "Eliminar cuenta",
        "Invalid password: your password is incorrect.": "Contraseña inválida: tu contraseña es incorrecta.",
        "Please enter your password:": "Por favor introduzca su contraseña :"
    }
}
